Autodesk.Revit.DB.Architecture.ContinuousRailType.ProfileId
The id of the profile of the rail
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profileId is not a valid element id.
-or-
When setting this property: The profileId is not a valid profile symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013